#### Продвинутые методы Pandas

В библиотеке pandas методы apply и map часто рассматриваются как более продвинутые инструменты для работы с данными, особенно когда дело касается обработки или трансформации данных.

In [1]:
# загрузка библиотек
import pandas as pd
import numpy as np

In [2]:
# генерация данных

# установка воспроизводимости
np.random.seed(0)
num = 100

employee_id = np.arange(1, num+1)
ages = np.random.randint(22, 60, size = num)
salary = np.random.randint(60, 120, size = num)
department = np.random.choice(['HR', 'IT', 'Marketing', 'Sales', 'Finance'], size = num)


# собираем в датафрейм

df = pd.DataFrame({
    'EmployeeID': employee_id,
    'Age': ages,
    'Salary': salary,
    'Department': department
    })

# посмотрим да данные
df.head()

   EmployeeID  Age  Salary Department
0           1   22     119         IT
1           2   25      63         IT
2           3   25      78    Finance
3           4   31     106         HR
4           5   41      95         HR

Метод **map()** в pandas применяется к **столбцам**, так как каждый столбец в DataFrame является объектом Series. Этот метод полезен для преобразования значений в конкретном столбце. Чаще всего используется для **замены** значений на другие с помощью словарей.

pandas.DataFrame.map
DataFrame.map(func, na_action=None, **kwargs)

In [3]:
# создаем словарь где ключ старое значение, а значение это новое значение
department_dict = {'HR':1 , 'IT':2, 'Marketing':3, 'Sales':4, 'Finance':5}

# присваиваем новому столбцу начения старого с применением функции
df['Department_num'] =  df['Department'].map(department_dict )

In [5]:
df.head()

   EmployeeID  Age  Salary Department  Department_num
0           1   22     119         IT               2
1           2   25      63         IT               2
2           3   25      78    Finance               5
3           4   31     106         HR               1
4           5   41      95         HR               1

Метод **apply()** в pandas позволяет легко выполнять операции над каждым элементом в столбце. Этот метод подходит для сложных вычислений и преобразований как на уровне Series, так и на уровне DataFrame. Он позволяет выполнять различные операции с помощью пользовательских **функций**.

DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), by_row='compat', engine='python', engine_kwargs=None)

In [6]:
# напишем функцию, которая вычисляет год из возраста

def year_of_birth(row):
    birth_year = 2024 - row
    return birth_year

In [10]:
# пользуясь apply применим новую функцию в столбцу 'Age'

df['birth_year'] = df['Age'].apply(year_of_birth)

In [9]:
df.head()

   EmployeeID  Age  Salary Department  Department_num  birth_year
0           1   22     119         IT               2        2002
1           2   25      63         IT               2        1999
2           3   25      78    Finance               5        1999
3           4   31     106         HR               1        1993
4           5   41      95         HR               1        1983